//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @File  iwashi.cpp
//!
//! @Brief  イワシクラスのソースーファイル
//!
//! @Date   2017/04/10
//!
//! @Author 河本恭宏
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

#include "cocos2d.h"

#include "Iwashi.h"

USING_NS_CC;

// ===========================================
// @>概　要:鰯を生成する関数
//
// @>引　数:なし
//
// @>戻り値:成功:true 失敗:fasle
// ===========================================
Iwashi Iwashi::GenerateIwashi()
{
	Iwashi(1, Vec2(0, 0));
}
